app/Controllers/Aluno.php

SELECT *
FROM `aluno`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `aluno`
---
    public function index(){
        $pesquisa = $this->request->getPost();
        if(count($pesquisa) > 0){
            $dados = $this->alunoModel->like('nome', $pesquisa['pesquisa'])
                                    ->orlike('cpf', $pesquisa['pesquisa'])
                                    ->orlike('email', $pesquisa['pesquisa'])
                                    ->orLike('telefone', $pesquisa['pesquisa'])
                                    ->orLike('turma',$pesquisa['pesquisa']);
            $dados = $dados->paginate(10);