app/Controllers/Autor.php

    public function index(){
        $dados = $this->autorModel->paginate(10);
---
SELECT *
FROM `autor`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `autor`

    public function editar($id){
        $dados = $this->autorModel->find($id);
---
SELECT *
FROM `autor`
WHERE `autor`.`id` = '1'