app/Controllers/Editora.php

    public function index(){
        $dados = $this->editoraModel->paginate(10);
---
SELECT *
FROM `editora`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `editora`