app/Controllers/Emprestimo.php

SELECT *
FROM `emprestimo`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
---
    public function index(){
        $emprestimo = $this->EmprestimoModel->paginate(10);
        $livro = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();

SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '4'
SELECT *
FROM `livro`
---
    public function editar($id)
    {
        $dados = $this->EmprestimoModel->find($id);
        $dadosaluno = $this->alunoModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $dadosusuario = $this->usuarioModel->findAll();
        $dadoslivro = $this->livroModel->findAll();

UPDATE `emprestimo` SET `data_fim` = '2024-07-01', `data_prazo` = '', `id_livro` = '1'
WHERE `emprestimo`.`id` IN ('21')
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('1')
---
    public function salvar(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro_antigo'],['disponivel' => 1]);

SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '18'
SELECT *
FROM `obra`
SELECT *
FROM `livro`
---
    public function devolucao($id){
        $emprestimo = $this->EmprestimoModel->find($id);
        $dadosobra = $this->obraModel->findAll();
        $livro = $this->livroModel->findAll();