app/Controllers/Livro.php

SELECT *
FROM `livro`
JOIN `obra` ON `livro`.`id_obra` = `obra`.`id`
WHERE `obra`.`titulo` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
OR  `status` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
OR  `disponivel` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `livro`
JOIN `obra` ON `livro`.`id_obra` = `obra`.`id`
WHERE `obra`.`titulo` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
OR  `status` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
OR  `disponivel` LIKE '%Harry Potter e a Criança Amaldiçoada%' ESCAPE '!'
---
    public function index(){

        $pesquisa = $this->request->getPost();
        if(count($pesquisa) > 0){
            $livro = $this->livroModel->join('obra', 'livro.id_obra = obra.id')
            ->orlike('obra.titulo',$pesquisa['pesquisa'])
            ->orlike('status',$pesquisa['pesquisa'])
            ->orlike('disponivel',$pesquisa['pesquisa']);
            //dd($livro);
            $livro = $livro->paginate(10);