app/Controllers/Livro.php

    public function index(){
        $statusdisponivel = LivroModel::STATUSLOCADO;
        $status = LivroModel::STATUSLIVRO;
        $obra = $this->obraModel->findAll();
        $livro = $this->livroModel->paginate(10);
---
SELECT *
FROM `obra`
SELECT *
FROM `livro`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `livro`

    public function editar($id){
        $statusdisponivel = LivroModel::STATUSLOCADO;
        $status = LivroModel::STATUSLIVRO;
        $livro = $this->livroModel->find($id);
        $obra = $this->obraModel->findAll();
---
SELECT *
FROM `livro`
WHERE `livro`.`id` = '6'
SELECT *
FROM `obra`