app/Controllers/Obra.php

SELECT *
FROM `obra`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `obra`
SELECT *
FROM `editora`
---
    public function index(){
        $obra = $this->obraModel->paginate(10);
        $editora = $this->editoraModel->findAll();