app/Controllers/Usuario.php

    public function index(){
        $pesquisa = $this->request->getPost();
        if(count($pesquisa) > 0){
        $dados = $this->usuarioModel->like('nome',$pesquisa['pesquisa'])
            ->orlike('email',$pesquisa['pesquisa'])
            ->orlike('telefone',$pesquisa['pesquisa']);
            $dados = $dados->paginate(10);
            //dd($dados);

        }else{
           $dados = $this->usuarioModel->paginate(10);
---
SELECT *
FROM `usuario`
 LIMIT 40, 10
SELECT COUNT(*) AS `numrows`
FROM `usuario`
SELECT *
FROM `usuario`
 LIMIT 10